Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2
Thread-safe dictionary that manages wrapped event handlers with reference counting.
The type of the original event handler object.
The type of the wrapped event handler object.

Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2.dictionary
Internal dictionary storing the wrapped handlers along with their reference counts.
The tuple contains the wrapped handler instance and its current reference count.

Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2.lockObject
Synchronization object.

Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2.Push(`0,System.Func{`0,`1})
Adds a wrapped handler for the specified original handler. It may return same object for same original handler,
but it internally uses reference counting to ensure that as many Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2.TryPop(`0,`1@)
succeeds as many Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2.Push(`0,System.Func{`0,`1}) were called with the same original handler.
original: The original event handler to wrap or retrieve.
wrapperFactory: Factory function that creates a new wrapped handler from the original handler.
NOTE: the factory is executed inside the lock and should not itself have side effects.
Returns: The wrapped event handler associated with the original handler.
Remarks:
This method is thread-safe. The caller is responsible for registering the received wrapper.

Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2.TryPop(`0,`1@)
Extracts the wrapped handler and removes it from the container in case of success. If several Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2.Push(`0,System.Func{`0,`1})
were called with same original handler, as many Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2.TryPop(`0,`1@) succeeds.
original: The original event handler whose wrapped handler should be released.
wrapped: When this method returns, contains the wrapped handler associated with the original handler,
or default value if the original handler was not found.
Returns:
true if the reference count reached zero and the entry was removed from the dictionary
(indicating the wrapped handler should be cleaned up);
false if the handler was found but still has remaining references, or if the handler was not found.
Remarks:
This method is thread-safe. When the method returns true, the caller is responsible
for proer unregistering the wrapped handler.

Tekla.Structures.ModelInternal.EventHandlerWrappersDictionary`2.PopAllWrappers
Removes and returns all wrapped handlers from the dictionary, clearing all reference counts.
Returns:
An enumerable collection of all wrapped handlers that were stored in the dictionary. Those which were stored several times
returned that exact times as well.
Remarks:
This method is thread-safe and clears the entire dictionary. After calling this method,
the caller is responsible for properly unregistering all returned wrapped handlers.
This is typically used during cleanup or shutdown scenarios.